backend/modules/dataroom/models/RoomCompany.php

    public static function getSectorActivityList()
    {

        $query = self::find()->where(['not', ['activitysector' => null]]);
        $query->orderBy(['id' => SORT_ASC]);

        $sectoractivitylist = $query->all();
---
SELECT * FROM `RoomCompany` WHERE NOT (`activitysector` IS NULL) ORDER BY `id`