backend/modules/dataroom/models/Room.php

INSERT INTO `RoomHistory` (`roomID`, `userID`, `hasFullAccess`, `ip`, `createdDate`) VALUES (27, NULL, 0, 1546024373, '2022-07-29 17:34:37')
---
    public function addHistoryRecord(User $user = null)
    {
        $history = new RoomHistory;
        $history->roomID = $this->id;
        $history->userID = $user && $user->id ? $user->id : null;
        $history->hasFullAccess = Yii::$app->user->can('seeRoomDetails', ['room' => $this]);
        $history->ip = ExecEnvironmentHelper::getUserIp(true);

        return $history->save();