backend/modules/metatags/models/MetaTags.php

    public static function findModel($nodeType, $nodeID)
    {
        return self::find()->where([
            'nodeType' => $nodeType,
            'nodeID' => $nodeID,
        ])->one();
---
SELECT * FROM `MetaTags` WHERE (`nodeType`='trendyPage') AND (`nodeID`=1)