backend/modules/staticpage/models/StaticPage.php

SELECT * FROM `StaticPage` WHERE `id`='1'
---
    public static function getPage($id)
    {
        return StaticPage::findOne($id);

SELECT `id` FROM `StaticPage` WHERE type = 'legal_notice'
---
    public static function getLegalNoticePageID()
    {
        return (new Query)->select(['id'])->from('StaticPage')->where('type = :type', [':type' => self::TYPE_LEGAL_NOTICE])->scalar();

SELECT `id` FROM `StaticPage` WHERE type = 'terms'
---
    public static function getTermsPageID()
    {
        return (new Query)->select(['id'])->from('StaticPage')->where('type = :type', [':type' => self::TYPE_TERMS])->scalar();