frontend/controllers/SiteController.php

SELECT * FROM `TrendyPageTestAB` WHERE `trendyPageLangID`=3
---
    public function actionTrendyPage($id, $json = false)
    {



        if (!$page = TrendyPage::getPage($id)) {
            throw new HttpException(404, 'Page not found.');
        }

        $test = TrendyPageTestAB::find()->where(['trendyPageLangID' => $page->translation->id])->one();