common/rbac/AskForAccessRule.php

    public function execute($user, $item, $params)
    {
        if (!isset($params['room'])) {
            return false;
        }

        if (!$params['room']->isPublished() && !$params['room']->proposalsAllowed) {
            return false;
        }

        $alreadyAsked = $params['room']->getRoomAccessRequests()
            ->andWhere(['RoomAccessRequest.userID' => $user])
            ->exists();
---
SELECT EXISTS(SELECT * FROM `RoomAccessRequest` WHERE (`RoomAccessRequest`.`userID` IS NULL) AND (`roomID`=27))