backend/modules/comments/widgets/Comments/Comments.php

    public function run()
    {
        $commentBundle = CommentBundle::find()->where([
            'nodeType' => $this->nodeType,
            'nodeID' => $this->nodeID
        ])->one();
---
SELECT * FROM `CommentBundle` WHERE (`nodeType`='trendyPage') AND (`nodeID`=1)